@zli82016 of course, here you go:
```hcl
resource "google_cloud_run_domain_mapping" "this" {
  location = google_cloud_run_v2_service.this.location
  project  = google_cloud_run_v2_service.this.project
  name     = "example.com"

  metadata {
    namespace = local.project_id
  }
  spec {
    route_name = google_cloud_run_v2_service.this.name
  }

  lifecycle {
    ignore_changes = [
      metadata[0].effective_labels,
      metadata[0].terraform_labels
    ]
  }
}
```

And the response:
```hcl
-/+ resource "google_cloud_run_domain_mapping" "this" {
      ~ id       = "redacted" -> (known after apply)
        name     = "example.com"
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "DomainRoutable"
                    },
                ]
              - mapped_route_name   = "service-name"
              - observed_generation = 1
              - resource_records    = [
                  - {
                      - name   = "sapi"
                      - rrdata = "ghs.googlehosted.com."
                      - type   = "CNAME"
                    },
                ]
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations           = {} -> null
          ~ effective_annotations = {
              - "run.googleapis.com/operation-id"  = "redacted"
              - "serving.knative.dev/creator"      = "redacted"
              - "serving.knative.dev/lastModifier" = "redacted"
            } -> (known after apply)
          ~ effective_labels      = { # forces replacement
              - "cloud.googleapis.com/location" = "us-central1" -> null
              + "environment"                   = "staging"
              + "goog-terraform-provisioned"    = "true"
              - "run.googleapis.com/overrideAt" = "2024-04-24T10:01:55.727Z" -> null
              + "terraform"                     = "true"
            }
          ~ generation            = 1 -> 0
          - labels                = {} -> null
          ~ resource_version      = "redacted" -> (known after apply)
          ~ self_link             = "redacted" -> (known after apply)
          ~ terraform_labels      = { # forces replacement
              + "environment"                = "staging"
              + "goog-terraform-provisioned" = "true"
              + "terraform"                  = "true"
            }
          ~ uid                   = "<redacted>" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - force_override   = false -> null
            # (2 unchanged attributes hidden)
        }
    }
```